In [1]:
import pandas as pd

In [2]:
data1 = pd.DataFrame({"k1" : [1, 2, 3, 4 ,5],
                     "k2" : [1, 4, 2, 3, 2],
                     "k3" : [1, 3, 53, 3, 3]})
data2 = pd.DataFrame({"c1" : ["A", 2, 3, 4 ,5],
                    "c2" : [1, 4, 2, 3, "Gupta"],
                    "c3" : [1, 3, "B", 3, 3]})
data3 = pd.DataFrame({"k1" : ["A", 2, 3, 4 ,5],
                    "k2" : [1, 4, 2, 3, "Gupta"],
                    "k3" : [1, 3, "B", 3, 3]})

In [4]:
data1

   k1  k2  k3
0   1   1   1
1   2   4   3
2   3   2  53
3   4   3   3
4   5   2   3

In [5]:
data2

  c1     c2 c3
0  A      1  1
1  2      4  3
2  3      2  B
3  4      3  3
4  5  Gupta  3

In [6]:
data3

  k1     k2 k3
0  A      1  1
1  2      4  3
2  3      2  B
3  4      3  3
4  5  Gupta  3

## Merge

### inner (default)

In [3]:
pd.merge(data1, data2, how = "inner", left_on=["k1", "k2"], right_on=["c1" ,"c2"])

  k1 k2  k3 c1 c2 c3
0  2  4   3  2  4  3
1  3  2  53  3  2  B
2  4  3   3  4  3  3

In [4]:
pd.merge(data1, data3, how = "inner", left_on=["k1", "k2"], right_on=["k1" ,"k2"])

  k1 k2  k3_x k3_y
0  2  4     3    3
1  3  2    53    B
2  4  3     3    3

In [5]:
pd.merge(data1, data3, how = "inner", on = ["k1", "k2"])  
# Above code can be rewritten by on paramter

  k1 k2  k3_x k3_y
0  2  4     3    3
1  3  2    53    B
2  4  3     3    3

### left

In [6]:
pd.merge(data1, data2, how = "left", left_on=["k1", "k2"], right_on=["c1" ,"c2"])

  k1 k2  k3   c1   c2   c3
0  1  1   1  NaN  NaN  NaN
1  2  4   3    2    4    3
2  3  2  53    3    2    B
3  4  3   3    4    3    3
4  5  2   3  NaN  NaN  NaN

# |Use case of Merge

#### Merge is very similar to vlookup

Suppose we have two data sets, first is having a lot of columns with a country ID column. In second data set we have two columns with country id and with country name. Now we want to add a column Country Name to the first data set, by matching the Country ID in to columns. So we can merge the two by keeping how = "left" which mesns we want to keep all left data, by matching country id, therefore lefton and righton will be country id

### conact

In [9]:
pd.concat([df1, df2]) it will add the daata of df2 below df1 by matching column header
pd.concat([df1, df2, axis = 1) ... it wil add the data of df2 to sidee of df1 by mathcing row header

SyntaxError: invalid syntax (3850798625.py, line 1)